src/main/resources/request/SendCreateJobRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:opt="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseMessages.xsd" xmlns:opt1="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd" xmlns:vis="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendCreateJobRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:CreateJobRequest>
                <opt:Job>
                    <opt1:Identity>
                        <opt1:Reference>?</opt1:Reference>
                    </opt1:Identity>
                    <!--Optional:-->
                    <opt1:Location>
                        <opt1:Address>?</opt1:Address>
                        <!--Optional:-->
                        <opt1:Reference>?</opt1:Reference>
                        <!--Optional:-->
                        <opt1:AddressDetail>
                            <!--Optional:-->
                            <opt1:Name>?</opt1:Name>
                            <opt1:Lines>
                                <!--Zero or more repetitions:-->
                                <opt1:AddressLine>?</opt1:AddressLine>
                            </opt1:Lines>
                            <!--Optional:-->
                            <opt1:HouseNo>?</opt1:HouseNo>
                            <!--Optional:-->
                            <opt1:PostCode>?</opt1:PostCode>
                            <!--Optional:-->
                            <opt1:GeoX>?</opt1:GeoX>
                            <!--Optional:-->
                            <opt1:GeoY>?</opt1:GeoY>
                        </opt1:AddressDetail>
                    </opt1:Location>
                    <!--Optional:-->
                    <opt1:Contact>
                        <!--Optional:-->
                        <opt1:Title>?</opt1:Title>
                        <opt1:Name>?</opt1:Name>
                        <!--Optional:-->
                        <opt1:HomePhone>?</opt1:HomePhone>
                        <!--Optional:-->
                        <opt1:WorkPhone>?</opt1:WorkPhone>
                        <!--Optional:-->
                        <opt1:MobilePhone>?</opt1:MobilePhone>
                        <!--Optional:-->
                        <opt1:Email>?</opt1:Email>
                        <!--Optional:-->
                        <opt1:URL>?</opt1:URL>
                        <!--Optional:-->
                        <opt1:ContactExtension>
                            <!--Optional:-->
                            <com:PreferredName>?</com:PreferredName>
                            <!--Optional:-->
                            <com:ID>?</com:ID>
                            <!--Optional:-->
                            <com:IDLabel>?</com:IDLabel>
                            <!--Optional:-->
                            <com:DateOfBirth>?</com:DateOfBirth>
                            <!--Optional:-->
                            <com:DateOfDeath>?</com:DateOfDeath>
                            <!--Optional:-->
                            <com:Gender>?</com:Gender>
                        </opt1:ContactExtension>
                    </opt1:Contact>
                    <opt1:Description>?</opt1:Description>
                    <!--Optional:-->
                    <opt1:SpecialInstructions>?</opt1:SpecialInstructions>
                    <!--Optional:-->
                    <opt1:DueDate>?</opt1:DueDate>
                    <!--Optional:-->
                    <opt1:DueStart>?</opt1:DueStart>
                    <!--Optional:-->
                    <opt1:DueEnd>?</opt1:DueEnd>
                    <opt1:Duration>?</opt1:Duration>
                    <!--Optional:-->
                    <opt1:Status>?</opt1:Status>
                    <!--Optional:-->
                    <opt1:VisitStatus>?</opt1:VisitStatus>
                    <opt1:VisitComplete>?</opt1:VisitComplete>
                    <opt1:Skills>
                        <!--Zero or more repetitions:-->
                        <opt1:Skill>?</opt1:Skill>
                    </opt1:Skills>
                    <!--Optional:-->
                    <opt1:Priority>?</opt1:Priority>
                    <opt1:Emergency>?</opt1:Emergency>
                    <opt1:WorkType>?</opt1:WorkType>
                    <!--Optional:-->
                    <opt1:Origin>?</opt1:Origin>
                    <!--Optional:-->
                    <opt1:ScheduleDate>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </opt1:ScheduleDate>
                    <!--Optional:-->
                    <opt1:ActualDate>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </opt1:ActualDate>
                    <opt1:Dispatched>?</opt1:Dispatched>
                    <!--Optional:-->
                    <opt1:DispatchDate>?</opt1:DispatchDate>
                    <!--Optional:-->
                    <opt1:AllocatedTo>
                        <opt1:Username>?</opt1:Username>
                    </opt1:AllocatedTo>
                    <opt1:AppointmentPending>?</opt1:AppointmentPending>
                    <!--Optional:-->
                    <opt1:AppointmentDate>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </opt1:AppointmentDate>
                    <!--Optional:-->
                    <opt1:WorkOrderReference>?</opt1:WorkOrderReference>
                    <!--Optional:-->
                    <opt1:AppointmentSlotTemplate>?</opt1:AppointmentSlotTemplate>
                    <!--Optional:-->
                    <opt1:CatalogueReference>?</opt1:CatalogueReference>
                    <!--Optional:-->
                    <opt1:ClientReference>?</opt1:ClientReference>
                    <!--Optional:-->
                    <opt1:GroupReference>?</opt1:GroupReference>
                    <!--Optional:-->
                    <opt1:World>
                        <opt1:Reference>?</opt1:Reference>
                    </opt1:World>
                    <!--Optional:-->
                    <opt1:Tasks>
                        <!--Zero or more repetitions:-->
                        <vis:Task>
                            <vis:LineNo>?</vis:LineNo>
                            <vis:Type>?</vis:Type>
                            <vis:Description>?</vis:Description>
                            <!--Optional:-->
                            <vis:Complete>?</vis:Complete>
                            <!--Optional:-->
                            <vis:Notes>?</vis:Notes>
                            <!--Optional:-->
                            <vis:Location>?</vis:Location>
                            <vis:Status>?</vis:Status>
                            <!--Optional:-->
                            <vis:AdditionalProperties>
                                <!--Zero or more repetitions:-->
                                <vis:AdditionalProperty>
                                    <vis:Name>?</vis:Name>
                                    <vis:Value>?</vis:Value>
                                    <!--Optional:-->
                                    <vis:AdditionalProperties/>
                                </vis:AdditionalProperty>
                            </vis:AdditionalProperties>
                        </vis:Task>
                    </opt1:Tasks>
                    <!--Optional:-->
                    <opt1:Attributes>
                        <!--Zero or more repetitions:-->
                        <opt1:NameValueAttribute>
                            <opt1:Name>?</opt1:Name>
                            <opt1:Value>?</opt1:Value>
                        </opt1:NameValueAttribute>
                    </opt1:Attributes>
                    <!--Optional:-->
                    <opt1:AdditionalProperties>
                        <!--Zero or more repetitions:-->
                        <vis:AdditionalProperty>
                            <vis:Name>?</vis:Name>
                            <vis:Value>?</vis:Value>
                            <!--Optional:-->
                            <vis:AdditionalProperties/>
                        </vis:AdditionalProperty>
                    </opt1:AdditionalProperties>
                    <!--Optional:-->
                    <opt1:RelatedJobs>
                        <!--Zero or more repetitions:-->
                        <opt1:Job>
                            <opt1:Identity>
                                <opt1:Reference>?</opt1:Reference>
                            </opt1:Identity>
                        </opt1:Job>
                    </opt1:RelatedJobs>
                    <!--Optional:-->
                    <opt1:MandatoryResource>
                        <opt1:Username>?</opt1:Username>
                    </opt1:MandatoryResource>
                    <!--Optional:-->
                    <opt1:PreferredResources>
                        <!--Zero or more repetitions:-->
                        <opt1:ResourceIdentity>
                            <opt1:Username>?</opt1:Username>
                        </opt1:ResourceIdentity>
                    </opt1:PreferredResources>
                    <!--Optional:-->
                    <opt1:ProhibitedResources>
                        <!--Zero or more repetitions:-->
                        <opt1:ResourceIdentity>
                            <opt1:Username>?</opt1:Username>
                        </opt1:ResourceIdentity>
                    </opt1:ProhibitedResources>
                </opt:Job>
                <!--Optional:-->
                <opt:HasPendingTasks>?</opt:HasPendingTasks>
                <!--Optional:-->
                <opt:HasPendingRelations>?</opt:HasPendingRelations>
            </mes:CreateJobRequest>
        </mes:SendCreateJobRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>